/*Some sample data shown and defined here to be used in testing of predicates*/

?- data(os1,Os1).
Os1 = [1.0, -1.0, 1.0, -1.0].

?- data(os2,Os2).
Os2 = [-1.0, -1.0, 1.0, -1.0].

?- data(os3,Os3).
Os3 = [-1.0, -1.0, 1.0, 1.0].

?- data(os4,Os4).
Os4 = [-1.0, -1.0, 1.0, -1.0, 1.0].

?- data(os1os3,Os1Os3).
Os1Os3 = [[1.0, -1.0, 1.0, -1.0], [-1.0, -1.0, 1.0, 1.0]].

?- data(os1,Os1),hopTrain([Os1],W1).
Os1 = [1.0, -1.0, 1.0, -1.0],
W1 = [[0.0, -1.0, 1.0, -1.0], [-1.0, 0.0, -1.0, 1.0], [1.0, -1.0, 0.0, -1.0], [-1.0, 1.0, -1.0, 0.0]]

?- data(os2,Os2),hopTrain([Os2],W2).
Os2 = [-1.0, -1.0, 1.0, -1.0],
W2 = [[0.0, 1.0, -1.0, 1.0], [1.0, 0.0, -1.0, 1.0], [-1.0, -1.0, 0.0, -1.0], [1.0, 1.0, -1.0, 0.0]].

?- data(os3,Os3),hopTrain([Os3],W3).
Os3 = [-1.0, -1.0, 1.0, 1.0],
W3 = [[0.0, 1.0, -1.0, -1.0], [1.0, 0.0, -1.0, -1.0], [-1.0, -1.0, 0.0, 1.0], [-1.0, -1.0, 1.0, 0.0]]

/*Two tests of each predicate*/

?- data(os2,Os2),hopTrain([Os2],W2),nextState(Os2,W2,NextState).
Os2 = NextState, NextState = [-1.0, -1.0, 1.0, -1.0],
W2 = [[0.0, 1.0, -1.0, 1.0], [1.0, 0.0, -1.0, 1.0], [-1.0, -1.0, 0.0, -1.0], [1.0, 1.0, -1.0, 0.0]].
?- data(os3,Os3),hopTrain([Os3],W3),nextState(Os3,W3,NextState).
Os3 = NextState, NextState = [-1.0, -1.0, 1.0, 1.0],
W3 = [[0.0, 1.0, -1.0, -1.0], [1.0, 0.0, -1.0, -1.0], [-1.0, -1.0, 0.0, 1.0], [-1.0, -1.0, 1.0, 0.0]]


?- updateN([-1.0,-1.0,-1.0],[[0.0,-1.0,-1.0],[-1.0,0.0,-1.0],[-1.0,-1.0,0.0]],2,ResultState).
ResultState = [-1.0, -1.0, -1.0].
?- updateN([-1.0,-1.0,-1.0],[[0.0,-1.0,-1.0],[-1.0,0.0,-1.0],[-1.0,-1.0,0.0]],3,ResultState).
ResultState = [1.0, 1.0, 1.0].


?- findsEquilibrium([1.0, -1.0, 1.0, -1.0],[[0.0, -1.0, 1.0, -1.0], [-1.0, 0.0, -1.0, 1.0], [1.0, -1.0, 0.0, -1.0], [-1.0, 1.0, -1.0, 0.0]],5).
true.
?- findsEquilibrium([-1.0,-1.0,-1.0],[[0.0,-1.0,-1.0],[-1.0,0.0,-1.0],[-1.0,-1.0,0.0]],3).
false.

?- data(os2,Os2),hopTrain([Os2],W2),energy(Os2,W2,Energy).
Os2 = [-1.0, -1.0, 1.0, -1.0],
W2 = [[0.0, 1.0, -1.0, 1.0], [1.0, 0.0, -1.0, 1.0], [-1.0, -1.0, 0.0, -1.0], [1.0, 1.0, -1.0, 0.0]],
Energy = -6.0.
?- energy([-1.0,-1.0,-1.0],[[0.0,-1.0,-1.0],[-1.0,0.0,-1.0],[-1.0,-1.0,0.0]],Energy).
Energy = 3.0.


?- data(os4,Os4),hopTrainAstate(Os4,WforState).
Os4 = [-1.0, -1.0, 1.0, -1.0, 1.0],
WforState = [[0.0, 1.0, -1.0, 1.0, -1.0], [1.0, 0.0, -1.0, 1.0, -1.0], [-1.0, -1.0, 0.0, -1.0, 1.0], [1.0, 1.0, -1.0, 0.0, -1.0], [-1.0, -1.0, 1.0, -1.0, 0.0]].
?- hopTrainAstate([-1.0,-1.0,-1.0],WforState).
WforState = [[0.0, 1.0, 1.0], [1.0, 0.0, 1.0], [1.0, 1.0, 0.0]].


?- data(os1os3,Os1Os3),hopTrain(Os1Os3,WeightMatrix).
Os1Os3 = [[1.0, -1.0, 1.0, -1.0], [-1.0, -1.0, 1.0, 1.0]],
WeightMatrix = [[0.0, 0.0, 0.0, -2.0], [0.0, 0.0, -2.0, 0.0], [0.0, -2.0, 0.0, 0.0], [-2.0, 0.0, 0.0, 0.0]].
?- hopTrain([[-1.0,-1.0,-1.0]],WeightMatrix).
WeightMatrix = [[0.0, 1.0, 1.0], [1.0, 0.0, 1.0], [1.0, 1.0, 0.0]].
